---
kind: type
id: T:Autodesk.Revit.DB.NurbSpline
source: html/65c43ffe-3972-ae2b-4aa4-e2901cdbb3a8.htm
---
# Autodesk.Revit.DB.NurbSpline

A nurb spline.

## Syntax (C#)
```csharp
public class NurbSpline : Curve
```

## Remarks
The nurb spline lies in the plane defined by control point, weight,knots,degree.